# Декларативное
# Задача 4: Поиск уникальных элементов в списке. Напишите программу, которая создает новый список, содержащий только уникальные элементы из исходного списка.

numbers = [1, 2, 2, 3, 3, 4, 5]
print(list(set(numbers)))